## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                 = [
          + {
              + object_id          = "fdc81a2e-97c2-4404-9be6-6219c393cf6f"
              + secret_permissions = [
                  + "Set",
                  + "Get",
                  + "Delete",
                  + "Purge",
                  + "Recover",
                  + "List",
                ]
              + tenant_id          = "67a46590-dce6-48df-bc40-7a458d7d58e4"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "eshopdemo-kv"
      + public_network_access_enabled = true
      + resource_group_name           = "eshopdemo-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "67a46590-dce6-48df-bc40-7a458d7d58e4"
      + vault_uri                     = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "eshopdemo-rg"
      + tags     = {
          + "createdWith" = "Terraform"
        }
    }

  # random_string.resource_prefix will be created
  + resource "random_string" "resource_prefix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.application_insights.azurerm_application_insights.resource will be created
  + resource "azurerm_application_insights" "resource" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "eshopdemo-insights"
      + resource_group_name                   = "eshopdemo-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "createdWith" = "Terraform"
          + "module"      = "application_insights"
        }
      + workspace_id                          = (known after apply)
    }

  # module.blob_private_dns_zone.azurerm_private_dns_zone.private_dns_zone will be created
  + resource "azurerm_private_dns_zone" "private_dns_zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "eshopdemo-rg"
    }

  # module.blob_private_dns_zone.azurerm_private_dns_zone_virtual_network_link.link["eshopdemo-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "link" {
      + id                    = (known after apply)
      + name                  = "link_to_eshopdemo-vnet"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "eshopdemo-rg"
      + virtual_network_id    = "/subscriptions/01227add-b439-488b-b565-b6fe43b8161e/resourceGroups/eshopdemo-rg/providers/Microsoft.Network/virtualNetworks/eshopdemo-vnet"
    }

  # module.blob_private_endpoint.azurerm_private_endpoint.private_endpoint will be created
  + resource "azurerm_private_endpoint" "private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "westeurope"
      + name                     = "EshopdemostoragePrivateEndpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "eshopdemo-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "createdWith" = "Terraform"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "BlobPrivateDnsZoneGroup"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "EshopdemostoragePrivateEndpointConnection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.container_apps.azurerm_container_app.container_app["eshop-web"] will be created
  + resource "azurerm_container_app" "container_app" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eshop-web"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eshopdemo-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "createdWith" = "Terraform"
        }

      + dapr {
          + app_id       = "eshop-web"
          + app_port     = 80
          + app_protocol = "http"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "http"

          + traffic_weight {
              + label           = "blue"
              + latest_revision = true
              + percentage      = 100
              + revision_suffix = "blue"
            }
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/rsciriano/eshoponweb:60f62ad9696c7ca581c866092b7e3827c1be0599"
              + memory            = "1Gi"
              + name              = "web"

              + env {
                  + name        = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + secret_name = "insights-connection"
                }
              + env {
                  + name  = "ASPNETCORE_URLS"
                  + value = "http://+:80"
                }
              + env {
                  + name        = "ConnectionStrings__CatalogConnection"
                  + secret_name = "catalog-connection"
                }
              + env {
                  + name        = "ConnectionStrings__IdentityConnection"
                  + secret_name = "identity-connection"
                }
              + env {
                  + name        = "ConnectionStrings__ServiceBus"
                  + secret_name = "servicebus-connection"
                }
              + env {
                  + name  = "ServiceBusEventPublisher__TopicOrQueueNames__OrderPaymentSucceeded"
                  + value = "order-payment-succeeded"
                }
              + env {
                  + name  = "Testing__LoadTestsAuthenticationEnabled"
                  + value = "true"
                }
            }
        }
    }

  # module.container_apps.azurerm_container_app_environment.managed_environment will be created
  + resource "azurerm_container_app_environment" "managed_environment" {
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + log_analytics_workspace_id       = (known after apply)
      + name                             = "eshopdemo-appenv"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "eshopdemo-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "createdWith" = "Terraform"
        }
    }

  # module.container_apps.azurerm_container_app_environment_dapr_component.dapr_component["statestore"] will be created
  + resource "azurerm_container_app_environment_dapr_component" "dapr_component" {
      + component_type               = "state.azure.blobstorage"
      + container_app_environment_id = (known after apply)
      + id                           = (known after apply)
      + ignore_errors                = false
      + init_timeout                 = "5s"
      + name                         = "statestore"
      + scopes                       = [
          + "eshop-web",
        ]
      + version                      = "v1"

      + metadata {
          + name  = "accountName"
          + value = "eshopdemostorage"
        }
      + metadata {
          + name  = "containerName"
          + value = "state"
        }
      + metadata {
          + name        = "accountKey"
          + secret_name = "storageaccountkey"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.log_analytics_workspace.azurerm_log_analytics_workspace.log_analytics_workspace will be created
  + resource "azurerm_log_analytics_workspace" "log_analytics_workspace" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westeurope"
      + name                               = "eshopdemo-logws"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "eshopdemo-rg"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "createdWith" = "Terraform"
          + "module"      = "log_analytics"
        }
      + workspace_id                       = (known after apply)
    }

  # module.mssql.azurerm_key_vault_secret.kv-sql-secret will be created
  + resource "azurerm_key_vault_secret" "kv-sql-secret" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "eshopdemo-sql-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mssql.azurerm_mssql_database.db["Catalog"] will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = 60
      + collation                           = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = 4
      + min_capacity                        = 0.5
      + name                                = "Catalog"
      + read_replica_count                  = (known after apply)
      + read_scale                          = false
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = "GP_S_Gen5_1"
      + storage_account_type                = "Geo"
      + tags                                = {
          + "createdWith" = "Terraform"
        }
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = false
    }

  # module.mssql.azurerm_mssql_database.db["Identity"] will be created
  + resource "azurerm_mssql_database" "db" {
      + auto_pause_delay_in_minutes         = 60
      + collation                           = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                         = "Default"
      + creation_source_database_id         = (known after apply)
      + geo_backup_enabled                  = true
      + id                                  = (known after apply)
      + ledger_enabled                      = (known after apply)
      + license_type                        = (known after apply)
      + maintenance_configuration_name      = (known after apply)
      + max_size_gb                         = 4
      + min_capacity                        = 0.5
      + name                                = "Identity"
      + read_replica_count                  = (known after apply)
      + read_scale                          = false
      + restore_point_in_time               = (known after apply)
      + sample_name                         = (known after apply)
      + server_id                           = (known after apply)
      + sku_name                            = "GP_S_Gen5_1"
      + storage_account_type                = "Geo"
      + tags                                = {
          + "createdWith" = "Terraform"
        }
      + transparent_data_encryption_enabled = true
      + zone_redundant                      = false
    }

  # module.mssql.azurerm_mssql_firewall_rule.firewall_rule will be created
  + resource "azurerm_mssql_firewall_rule" "firewall_rule" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "Allow access to Azure services"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # module.mssql.azurerm_mssql_server.server will be created
  + resource "azurerm_mssql_server" "server" {
      + administrator_login                  = "eshopdemo-sql-admin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "westeurope"
      + minimum_tls_version                  = "1.2"
      + name                                 = "eshopdemo-sql"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "eshopdemo-rg"
      + restorable_dropped_database_ids      = (known after apply)
      + version                              = "12.0"
    }

  # module.mssql.random_password.sql_password will be created
  + resource "random_password" "sql_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#~$%&,."
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.servicebus.azurerm_servicebus_namespace.namespace will be created
  + resource "azurerm_servicebus_namespace" "namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "westeurope"
      + minimum_tls_version                 = (known after apply)
      + name                                = "eshopdemo-sbus"
      + public_network_access_enabled       = true
      + resource_group_name                 = "eshopdemo-rg"
      + sku                                 = "Standard"
      + tags                                = {
          + "createdWith" = "Terraform"
        }
    }

  # module.servicebus.azurerm_servicebus_subscription.subscription["ReservedQuantityUpdater"] will be created
  + resource "azurerm_servicebus_subscription" "subscription" {
      + auto_delete_on_idle                       = (known after apply)
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + default_message_ttl                       = (known after apply)
      + id                                        = (known after apply)
      + lock_duration                             = (known after apply)
      + max_delivery_count                        = 3
      + name                                      = "ReservedQuantityUpdater"
      + status                                    = "Active"
      + topic_id                                  = (known after apply)
    }

  # module.servicebus.azurerm_servicebus_topic.topic["order-payment-succeeded"] will be created
  + resource "azurerm_servicebus_topic" "topic" {
      + auto_delete_on_idle                     = (known after apply)
      + default_message_ttl                     = (known after apply)
      + duplicate_detection_history_time_window = (known after apply)
      + id                                      = (known after apply)
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = (known after apply)
      + name                                    = "order-payment-succeeded"
      + namespace_id                            = (known after apply)
      + status                                  = "Active"
    }

  # module.storage_account.azurerm_storage_account.storage_account will be created
  + resource "azurerm_storage_account" "storage_account" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "eshopdemostorage"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "eshopdemo-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "createdWith" = "Terraform"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.virtual_network.azurerm_monitor_diagnostic_setting.settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = "AzureDiagnostics"
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "DiagnosticsSettings"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "VMProtectionAlerts"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

  # module.virtual_network.azurerm_subnet.subnet["ContainerApps"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/20",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ContainerApps"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "eshopdemo-rg"
      + virtual_network_name                           = "eshopdemo-vnet"
    }

  # module.virtual_network.azurerm_subnet.subnet["PrivateEndpoints"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.16.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "PrivateEndpoints"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "eshopdemo-rg"
      + virtual_network_name                           = "eshopdemo-vnet"
    }

  # module.virtual_network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "eshopdemo-vnet"
      + resource_group_name = "eshopdemo-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "createdWith" = "Terraform"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + log_analytics_name          = "eshopdemo-logws"
  + log_analytics_workspace_id  = (known after apply)
  + mssql_conection_strings     = (sensitive value)
  + servicebus_conection_string = (sensitive value)
```
</details>